Tekla Open API Reference for Tekla Structures 2025
LevelMark.LevelMarkAttributes.TransparentBackground Property
 Gets or sets a value indicating whether the transparency of the background of the level mark text is enabled.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LevelMark.LevelMarkAttributes Class
Tekla.Structures.Drawing Namespace